huybk213/nrf52-how-to-reject-bonding-from-central/ble_app_hids_keyboard_Yes_or_No/main.c
static ble_uuid_t m_adv_uuids[] = {{BLE_UUID_HUMAN_INTERFACE_DEVICE_SERVICE, BLE_UUID_TYPE_BLE}};

static uint8_t m_sample_key_press_scan_str[] = /**< Key pattern to be sent when the key press button has been pushed. */
{
        0x0b,   /* Key h */
        0x08,   /* Key e */
        0x0f,   /* Key l */
        0x0f,   /* Key l */
        0x12,   /* Key o */
        0x28    /* Key Return */
};

static uint8_t m_caps_on_key_scan_str[] = /**< Key pattern to be sent when the output report has been written with the CAPS LOCK bit set. */
{
        0x06,   /* Key C */
        0x04,   /* Key a */
        0x13,   /* Key p */
        0x16,   /* Key s */
        0x12,   /* Key o */
        0x11,   /* Key n */
};

static uint8_t m_caps_off_key_scan_str[] = /**< Key pattern to be sent when the output report has been written with the CAPS LOCK bit cleared. */
{
        0x06,   /* Key C */
        0x04,   /* Key a */
        0x13,   /* Key p */
        0x16,   /* Key s */
        0x12,   /* Key o */
        0x09,   /* Key f */
};

static void on_hids_evt(ble_hids_t * p_hids, ble_hids_evt_t * p_evt);

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
        app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for setting filtered whitelist.
 *
 * @param[in] skip  Filter passed to @ref pm_peer_id_list.
 */
static void whitelist_set(pm_peer_id_list_skip_t skip)
{
        pm_peer_id_t peer_ids[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];
        uint32_t peer_id_count = BLE_GAP_WHITELIST_ADDR_MAX_COUNT;

        ret_code_t err_code = pm_peer_id_list(peer_ids, &peer_id_count, PM_PEER_ID_INVALID, skip);
        APP_ERROR_CHECK(err_code);

        NRF_LOG_INFO("\tm_whitelist_peer_cnt %d, MAX_PEERS_WLIST %d",
                     peer_id_count + 1,
                     BLE_GAP_WHITELIST_ADDR_MAX_COUNT);

        err_code = pm_whitelist_set(peer_ids, peer_id_count);
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for setting filtered device identities.
 *
 * @param[in] skip  Filter passed to @ref pm_peer_id_list.
 */
static void identities_set(pm_peer_id_list_skip_t skip)
{
        pm_peer_id_t peer_ids[BLE_GAP_DEVICE_IDENTITIES_MAX_COUNT];
        uint32_t peer_id_count = BLE_GAP_DEVICE_IDENTITIES_MAX_COUNT;

        ret_code_t err_code = pm_peer_id_list(peer_ids, &peer_id_count, PM_PEER_ID_INVALID, skip);
        APP_ERROR_CHECK(err_code);

        err_code = pm_device_identities_list_set(peer_ids, peer_id_count);
        APP_ERROR_CHECK(err_code);
}


/**@brief Clear bond information from persistent storage.
 */
static void delete_bonds(void)
{
        ret_code_t err_code;

        NRF_LOG_INFO("Erase bonds!");

        err_code = pm_peers_delete();
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting advertising.
 */
static void advertising_start(bool erase_bonds)
{
        if (erase_bonds == true)
        {
                delete_bonds();
                // Advertising is started by PM_EVT_PEERS_DELETE_SUCCEEDED event.
        }
        else
        {
                whitelist_set(PM_PEER_ID_LIST_SKIP_NO_ID_ADDR);

                ret_code_t ret = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
                APP_ERROR_CHECK(ret);
        }
}

#if PM_SECURITY_USER_SELECTION_ENABLED

#define BONDING_REPLY_TIMEOUT_INTERVAL         APP_TIMER_TICKS(30000)                      /**< Timer for User answering bonding Accept or Reject (interval (ticks)). */
APP_TIMER_DEF(m_bonding_reply_timer_id);                                                   /**< Battery timer. */
static bool m_bonding_reply_timer_is_running;

// The context type that is used in PM_EVT_CONN_SEC_PARAMS_REQ events and in calls to sm_sec_params_reply().
typedef struct
{
        ble_gap_sec_params_t * p_sec_params;     //!< The security parameters to use in the call to the security_dispatcher
        ble_gap_sec_params_t sec_params_mem;     //!< The buffer for holding the security parameters.
        bool params_reply_called;                //!< Whether @ref sm_sec_params_reply has been called for this context instance.
} local_sec_params_reply_context_t;


static ble_gap_sec_params_t m_sec_param;                                /**< Current Peer Manager secure parameters configuration. */
static local_sec_params_reply_context_t m_sec_params_reply_context;

/**@brief function local file
 *
 *
 */
static ret_code_t local_pm_secure_mode_set(void)
{
        ret_code_t err_code = NRF_SUCCESS;
        memset(&m_sec_param, 0x00, sizeof(m_sec_param));

        // Common security parameters to be used for all security procedures.
        m_sec_param.min_key_size   = SEC_PARAM_MIN_KEY_SIZE;
        m_sec_param.max_key_size   = SEC_PARAM_MAX_KEY_SIZE;
        m_sec_param.keypress       = SEC_PARAM_MIN_KEY_SIZE;
        m_sec_param.io_caps        = SEC_PARAM_IO_CAPABILITIES;
        m_sec_param.bond           = SEC_PARAM_BOND;

        // If bonding is not enabled, no keys can be distributed.
        m_sec_param.kdist_own.enc  = 1;
        m_sec_param.kdist_own.id   = 1;
        m_sec_param.kdist_peer.enc = 1;
        m_sec_param.kdist_peer.id  = 1;

        // Update Peer Manager security parameter settings.
        err_code = pm_sec_params_set(&m_sec_param);
        APP_ERROR_CHECK(err_code);

        return err_code;
}

static void bonding_reply_timer_stop(void)
{
        m_bonding_reply_timer_is_running = false;
        app_timer_stop(m_bonding_reply_timer_id);
}

static void bonding_reply_timer_start(void)
{
  #if PM_SECURITY_USER_SELECTION_ENABLED
        ret_code_t err_code;
        err_code = app_timer_start(m_bonding_reply_timer_id, BONDING_REPLY_TIMEOUT_INTERVAL, NULL);
        APP_ERROR_CHECK(err_code);
        m_bonding_reply_timer_is_running = true;
  #endif
}

