huybk213/nrf52-how-to-reject-bonding-from-central/ble_app_hids_keyboard_Yes_or_No/main.c
/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *
 * @param[in]   p_context   Pointer used for passing some arbitrary information (context) from the
 *                          app_start_timer() call to the timeout handler.
 */
static void bonding_reply_timeout_handler(void * p_context)
{
        UNUSED_PARAMETER(p_context);
        NRF_LOG_DEBUG("Timeout for USER Answer bonding request and then reject!");
        if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
        {
                ret_code_t err_code = sd_ble_gap_sec_params_reply(m_conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, &m_sec_params_reply_context);
                APP_ERROR_CHECK(err_code);
        }
}

#endif

/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
        pm_handler_on_pm_evt(p_evt);
        pm_handler_flash_clean(p_evt);

        NRF_LOG_DEBUG("%s, evt_id = %02x", __func__, p_evt->evt_id);
        ret_code_t err_code;

        switch (p_evt->evt_id)
        {
#if PM_SECURITY_USER_SELECTION_ENABLED
        case PM_EVT_CONN_SEC_PARAMS_REQ_PENDING:
                //Waiting for the user to answer Yes/No on bonding request
                NRF_LOG_DEBUG("pm_evt_handler : PM_EVT_CONN_SEC_PARAMS_REQ_PENDING");

                memset(&m_sec_params_reply_context, 0, sizeof(m_sec_params_reply_context));
                memcpy(&m_sec_params_reply_context, p_evt->params.conn_sec_params_req.p_context, sizeof(p_evt->params.conn_sec_params_req.p_context));
                bonding_reply_timer_start();
                break;
#endif
        case PM_EVT_CONN_SEC_PARAMS_REQ:               /**< @brief Security parameters (@ref ble_gap_sec_params_t) are needed for an ongoing security procedure. Reply wit @ref pm_conn_sec_params_reply before the event handler returns. If no reply is sent, the parameters given in @ref pm_sec_params_set are used. If a peripheral connection, the central's sec_params will be available in the event. */
        {
                NRF_LOG_DEBUG("pm_evt_handler : PM_EVT_CONN_SEC_PARAMS_REQ");
        }
        break;
        case PM_EVT_BONDED_PEER_CONNECTED:              /**< @brief A security procedure has started on a link, initiated either locally or remotely. The security procedure is using the last parameters provided via @ref pm_sec_params_set. This event is always followed by either a @ref PM_EVT_CONN_SEC_SUCCEEDED or a @ref PM_EVT_CONN_SEC_FAILED event. This is an informational event; no action is needed for the procedure to proceed. */
        case PM_EVT_CONN_SEC_FAILED:                   /**< @brief A pairing or encryption procedure has failed. In some cases, this means that security is not possible on this link (temporarily or permanently). How to handle this error depends on the application. */
        case PM_EVT_CONN_SEC_CONFIG_REQ:               /**< @brief The peer (central) has requested pairing, but a bond already exists with that peer. Reply by calling @ref pm_conn_sec_config_reply before the event handler returns. If no reply is sent, a default is used. */
        case PM_EVT_STORAGE_FULL:                      /**< @brief There is no more room for peer data in flash storage. To solve this problem, delete data that is not needed anymore and run a garbage collection procedure in FDS. */
        case PM_EVT_ERROR_UNEXPECTED:                  /**< @brief An unrecoverable error happened inside Peer Manager. An operation failed with the provided error. */
        case PM_EVT_PEER_DATA_UPDATE_FAILED:           /**< @brief A piece of peer data could not be stored, updated, or cleared in flash storage. This event is sent instead of @ref PM_EVT_PEER_DATA_UPDATE_SUCCEEDED for the failed operation. */
        case PM_EVT_PEER_DELETE_SUCCEEDED:             /**< @brief A peer was cleared from flash storage, for example because a call to @ref pm_peer_delete succeeded. This event can also be sent as part of a call to @ref pm_peers_delete or internal cleanup. */
        case PM_EVT_PEER_DELETE_FAILED:                /**< @brief A peer could not be cleared from flash storage. This event is sent instead of @ref PM_EVT_PEER_DELETE_SUCCEEDED for the failed operation. */
        case PM_EVT_PEERS_DELETE_FAILED:               /**< @brief A call to @ref pm_peers_delete has failed, which means that at least one of the peers could not be deleted. Other peers might have been deleted, or might still be queued to be deleted. No more @ref PM_EVT_PEERS_DELETE_SUCCEEDED or @ref PM_EVT_PEERS_DELETE_FAILED events are sent until the next time @ref pm_peers_delete is called. */
        case PM_EVT_LOCAL_DB_CACHE_APPLIED:            /**< @brief Local database values for a peer (taken from flash storage) have been provided to the SoftDevice. */
        case PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED:       /**< @brief Local database values for a peer (taken from flash storage) were rejected by the SoftDevice, which means that either the database has changed or the user has manually set the local database to an invalid value (using @ref pm_peer_data_store). */
        case PM_EVT_SERVICE_CHANGED_IND_SENT:          /**< @brief A service changed indication has been sent to a peer, as a result of a call to @ref pm_local_database_has_changed. This event will be followed by a @ref PM_EVT_SERVICE_CHANGED_IND_CONFIRMED event if the peer acknowledges the indication. */
        case PM_EVT_SERVICE_CHANGED_IND_CONFIRMED:     /**< @brief A service changed indication that was sent has been confirmed by a peer. The peer can now be considered aware that the local database has changed. */
        case PM_EVT_SLAVE_SECURITY_REQ:                /**< @brief The peer (peripheral) has requested link encryption, which has been enabled. */
        case PM_EVT_FLASH_GARBAGE_COLLECTED:           /**< @brief The flash has been garbage collected (By FDS), possibly freeing up space. */
        case PM_EVT_FLASH_GARBAGE_COLLECTION_FAILED:   /**< @brief Garbage collection was attempted but failed. */

                break;

