huybk213/nrf52-how-to-reject-bonding-from-central/ble_app_hids_keyboard_Yes_or_No/main.c
        case PM_EVT_PEERS_DELETE_SUCCEEDED:
                advertising_start(false);
                break;

        case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
                if (     p_evt->params.peer_data_update_succeeded.flash_changed
                         && (p_evt->params.peer_data_update_succeeded.data_id == PM_PEER_DATA_ID_BONDING))
                {
                        NRF_LOG_INFO("New Bond, add the peer to the whitelist if possible");
                        // Note: You should check on what kind of white list policy your application should use.

                        whitelist_set(PM_PEER_ID_LIST_SKIP_NO_ID_ADDR);
                }
                break;

        default:
                break;
        }
}


/**@brief Function for handling Service errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void service_error_handler(uint32_t nrf_error)
{
        APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling advertising errors.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void ble_advertising_error_handler(uint32_t nrf_error)
{
        APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for performing a battery measurement, and update the Battery Level characteristic in the Battery Service.
 */
static void battery_level_update(void)
{
        ret_code_t err_code;
        uint8_t battery_level;

        battery_level = (uint8_t)sensorsim_measure(&m_battery_sim_state, &m_battery_sim_cfg);

        err_code = ble_bas_battery_level_update(&m_bas, battery_level, BLE_CONN_HANDLE_ALL);
        if ((err_code != NRF_SUCCESS) &&
            (err_code != NRF_ERROR_BUSY) &&
            (err_code != NRF_ERROR_RESOURCES) &&
            (err_code != NRF_ERROR_FORBIDDEN) &&
            (err_code != NRF_ERROR_INVALID_STATE) &&
            (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
            )
        {
                APP_ERROR_HANDLER(err_code);
        }
}


/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *
 * @param[in]   p_context   Pointer used for passing some arbitrary information (context) from the
 *                          app_start_timer() call to the timeout handler.
 */
static void battery_level_meas_timeout_handler(void * p_context)
{
        UNUSED_PARAMETER(p_context);
        battery_level_update();
}


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init(void)
{
        ret_code_t err_code;

        err_code = app_timer_init();
        APP_ERROR_CHECK(err_code);

        // Create battery timer.
        err_code = app_timer_create(&m_battery_timer_id,
                                    APP_TIMER_MODE_REPEATED,
                                    battery_level_meas_timeout_handler);
        APP_ERROR_CHECK(err_code);

#if PM_SECURITY_USER_SELECTION_ENABLED
// Create battery timer.
        m_bonding_reply_timer_is_running = false;
        err_code = app_timer_create(&m_bonding_reply_timer_id,
                                    APP_TIMER_MODE_SINGLE_SHOT,
                                    bonding_reply_timeout_handler);
        APP_ERROR_CHECK(err_code);
#endif
}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
        ret_code_t err_code;
        ble_gap_conn_params_t gap_conn_params;
        ble_gap_conn_sec_mode_t sec_mode;

        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

        err_code = sd_ble_gap_device_name_set(&sec_mode,
                                              (const uint8_t *)DEVICE_NAME,
                                              strlen(DEVICE_NAME));
        APP_ERROR_CHECK(err_code);

        err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_HID_KEYBOARD);
        APP_ERROR_CHECK(err_code);

        memset(&gap_conn_params, 0, sizeof(gap_conn_params));

        gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
        gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
        gap_conn_params.slave_latency     = SLAVE_LATENCY;
        gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

        err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
        ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
        APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Queued Write Module.
 */
static void qwr_init(void)
{
        ret_code_t err_code;
        nrf_ble_qwr_init_t qwr_init_obj = {0};

        qwr_init_obj.error_handler = nrf_qwr_error_handler;

        err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init_obj);
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing Device Information Service.
 */
static void dis_init(void)
{
        ret_code_t err_code;
        ble_dis_init_t dis_init_obj;
        ble_dis_pnp_id_t pnp_id;

        pnp_id.vendor_id_source = PNP_ID_VENDOR_ID_SOURCE;
        pnp_id.vendor_id        = PNP_ID_VENDOR_ID;
        pnp_id.product_id       = PNP_ID_PRODUCT_ID;
        pnp_id.product_version  = PNP_ID_PRODUCT_VERSION;

        memset(&dis_init_obj, 0, sizeof(dis_init_obj));

        ble_srv_ascii_to_utf8(&dis_init_obj.manufact_name_str, MANUFACTURER_NAME);
        dis_init_obj.p_pnp_id = &pnp_id;

