huybk213/nrf52-how-to-reject-bonding-from-central/ble_app_hids_keyboard_Yes_or_No/main.c
        err_code = ble_conn_params_init(&cp_init);
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting timers.
 */
static void timers_start(void)
{
        ret_code_t err_code;

        err_code = app_timer_start(m_battery_timer_id, BATTERY_LEVEL_MEAS_INTERVAL, NULL);
        APP_ERROR_CHECK(err_code);

}


/**@brief   Function for transmitting a key scan Press & Release Notification.
 *
 * @warning This handler is an example only. You need to analyze how you wish to send the key
 *          release.
 *
 * @param[in]  p_instance     Identifies the service for which Key Notifications are requested.
 * @param[in]  p_key_pattern  Pointer to key pattern.
 * @param[in]  pattern_len    Length of key pattern. 0 < pattern_len < 7.
 * @param[in]  pattern_offset Offset applied to Key Pattern for transmission.
 * @param[out] actual_len     Provides actual length of Key Pattern transmitted, making buffering of
 *                            rest possible if needed.
 * @return     NRF_SUCCESS on success, NRF_ERROR_RESOURCES in case transmission could not be
 *             completed due to lack of transmission buffer or other error codes indicating reason
 *             for failure.
 *
 * @note       In case of NRF_ERROR_RESOURCES, remaining pattern that could not be transmitted
 *             can be enqueued \ref buffer_enqueue function.
 *             In case a pattern of 'cofFEe' is the p_key_pattern, with pattern_len as 6 and
 *             pattern_offset as 0, the notifications as observed on the peer side would be
 *             1>    'c', 'o', 'f', 'F', 'E', 'e'
 *             2>    -  , 'o', 'f', 'F', 'E', 'e'
 *             3>    -  ,   -, 'f', 'F', 'E', 'e'
 *             4>    -  ,   -,   -, 'F', 'E', 'e'
 *             5>    -  ,   -,   -,   -, 'E', 'e'
 *             6>    -  ,   -,   -,   -,   -, 'e'
 *             7>    -  ,   -,   -,   -,   -,  -
 *             Here, '-' refers to release, 'c' refers to the key character being transmitted.
 *             Therefore 7 notifications will be sent.
 *             In case an offset of 4 was provided, the pattern notifications sent will be from 5-7
 *             will be transmitted.
 */
static uint32_t send_key_scan_press_release(ble_hids_t * p_hids,
                                            uint8_t    * p_key_pattern,
                                            uint16_t pattern_len,
                                            uint16_t pattern_offset,
                                            uint16_t   * p_actual_len)
{
        ret_code_t err_code;
        uint16_t offset;
        uint16_t data_len;
        uint8_t data[INPUT_REPORT_KEYS_MAX_LEN];

        // HID Report Descriptor enumerates an array of size 6, the pattern hence shall not be any
        // longer than this.
        STATIC_ASSERT((INPUT_REPORT_KEYS_MAX_LEN - 2) == 6);

        ASSERT(pattern_len <= (INPUT_REPORT_KEYS_MAX_LEN - 2));

        offset   = pattern_offset;
        data_len = pattern_len;

        do
        {
                // Reset the data buffer.
                memset(data, 0, sizeof(data));

                // Copy the scan code.
                memcpy(data + SCAN_CODE_POS + offset, p_key_pattern + offset, data_len - offset);

                if (bsp_button_is_pressed(SHIFT_BUTTON_ID))
                {
                        data[MODIFIER_KEY_POS] |= SHIFT_KEY_CODE;
                }

                if (!m_in_boot_mode)
                {
                        err_code = ble_hids_inp_rep_send(p_hids,
                                                         INPUT_REPORT_KEYS_INDEX,
                                                         INPUT_REPORT_KEYS_MAX_LEN,
                                                         data,
                                                         m_conn_handle);
                }
                else
                {
                        err_code = ble_hids_boot_kb_inp_rep_send(p_hids,
                                                                 INPUT_REPORT_KEYS_MAX_LEN,
                                                                 data,
                                                                 m_conn_handle);
                }

                if (err_code != NRF_SUCCESS)
                {
                        break;
                }

                offset++;
        }
        while (offset <= data_len);

        *p_actual_len = offset;

        return err_code;
}


/**@brief   Function for initializing the buffer queue used to key events that could not be
 *          transmitted
 *
 * @warning This handler is an example only. You need to analyze how you wish to buffer or buffer at
 *          all.
 *
 * @note    In case of HID keyboard, a temporary buffering could be employed to handle scenarios
 *          where encryption is not yet enabled or there was a momentary link loss or there were no
 *          Transmit buffers.
 */
static void buffer_init(void)
{
        uint32_t buffer_count;

        BUFFER_LIST_INIT();

        for (buffer_count = 0; buffer_count < MAX_BUFFER_ENTRIES; buffer_count++)
        {
                BUFFER_ELEMENT_INIT(buffer_count);
        }
}


/**@brief Function for enqueuing key scan patterns that could not be transmitted either completely
 *        or partially.
 *
 * @warning This handler is an example only. You need to analyze how you wish to send the key
 *          release.
 *
 * @param[in]  p_hids         Identifies the service for which Key Notifications are buffered.
 * @param[in]  p_key_pattern  Pointer to key pattern.
 * @param[in]  pattern_len    Length of key pattern.
 * @param[in]  offset         Offset applied to Key Pattern when requesting a transmission on
 *                            dequeue, @ref buffer_dequeue.
 * @return     NRF_SUCCESS on success, else an error code indicating reason for failure.
 */
static uint32_t buffer_enqueue(ble_hids_t * p_hids,
                               uint8_t    * p_key_pattern,
                               uint16_t pattern_len,
                               uint16_t offset)
{
        buffer_entry_t * element;
        uint32_t err_code = NRF_SUCCESS;

