huybk213/nrf52-how-to-reject-bonding-from-central/ble_app_hids_keyboard_Yes_or_No/main.c
        if (BUFFER_LIST_FULL())
        {
                // Element cannot be buffered.
                err_code = NRF_ERROR_NO_MEM;
        }
        else
        {
                // Make entry of buffer element and copy data.
                element              = &buffer_list.buffer[(buffer_list.wp)];
                element->p_instance  = p_hids;
                element->p_data      = p_key_pattern;
                element->data_offset = offset;
                element->data_len    = pattern_len;

                buffer_list.count++;
                buffer_list.wp++;

                if (buffer_list.wp == MAX_BUFFER_ENTRIES)
                {
                        buffer_list.wp = 0;
                }
        }

        return err_code;
}


/**@brief   Function to dequeue key scan patterns that could not be transmitted either completely of
 *          partially.
 *
 * @warning This handler is an example only. You need to analyze how you wish to send the key
 *          release.
 *
 * @param[in]  tx_flag   Indicative of whether the dequeue should result in transmission or not.
 * @note       A typical example when all keys are dequeued with transmission is when link is
 *             disconnected.
 *
 * @return     NRF_SUCCESS on success, else an error code indicating reason for failure.
 */
static uint32_t buffer_dequeue(bool tx_flag)
{
        buffer_entry_t * p_element;
        uint32_t err_code = NRF_SUCCESS;
        uint16_t actual_len;

        if (BUFFER_LIST_EMPTY())
        {
                err_code = NRF_ERROR_NOT_FOUND;
        }
        else
        {
                bool remove_element = true;

                p_element = &buffer_list.buffer[(buffer_list.rp)];

                if (tx_flag)
                {
                        err_code = send_key_scan_press_release(p_element->p_instance,
                                                               p_element->p_data,
                                                               p_element->data_len,
                                                               p_element->data_offset,
                                                               &actual_len);
                        // An additional notification is needed for release of all keys, therefore check
                        // is for actual_len <= element->data_len and not actual_len < element->data_len
                        if ((err_code == NRF_ERROR_RESOURCES) && (actual_len <= p_element->data_len))
                        {
                                // Transmission could not be completed, do not remove the entry, adjust next data to
                                // be transmitted
                                p_element->data_offset = actual_len;
                                remove_element         = false;
                        }
                }

                if (remove_element)
                {
                        BUFFER_ELEMENT_INIT(buffer_list.rp);

                        buffer_list.rp++;
                        buffer_list.count--;

                        if (buffer_list.rp == MAX_BUFFER_ENTRIES)
                        {
                                buffer_list.rp = 0;
                        }
                }
        }

        return err_code;
}


/**@brief Function for sending sample key presses to the peer.
 *
 * @param[in]   key_pattern_len   Pattern length.
 * @param[in]   p_key_pattern     Pattern to be sent.
 */
static void keys_send(uint8_t key_pattern_len, uint8_t * p_key_pattern)
{
        ret_code_t err_code;
        uint16_t actual_len;

        err_code = send_key_scan_press_release(&m_hids,
                                               p_key_pattern,
                                               key_pattern_len,
                                               0,
                                               &actual_len);
        // An additional notification is needed for release of all keys, therefore check
        // is for actual_len <= key_pattern_len and not actual_len < key_pattern_len.
        if ((err_code == NRF_ERROR_RESOURCES) && (actual_len <= key_pattern_len))
        {
                // Buffer enqueue routine return value is not intentionally checked.
                // Rationale: Its better to have a a few keys missing than have a system
                // reset. Recommendation is to work out most optimal value for
                // MAX_BUFFER_ENTRIES to minimize chances of buffer queue full condition
                UNUSED_VARIABLE(buffer_enqueue(&m_hids, p_key_pattern, key_pattern_len, actual_len));
        }


        if ((err_code != NRF_SUCCESS) &&
            (err_code != NRF_ERROR_INVALID_STATE) &&
            (err_code != NRF_ERROR_RESOURCES) &&
            (err_code != NRF_ERROR_BUSY) &&
            (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
            )
        {
                APP_ERROR_HANDLER(err_code);
        }
}


/**@brief Function for handling the HID Report Characteristic Write event.
 *
 * @param[in]   p_evt   HID service event.
 */
static void on_hid_rep_char_write(ble_hids_evt_t * p_evt)
{
        if (p_evt->params.char_write.char_id.rep_type == BLE_HIDS_REP_TYPE_OUTPUT)
        {
                ret_code_t err_code;
                uint8_t report_val;
                uint8_t report_index = p_evt->params.char_write.char_id.rep_index;

                if (report_index == OUTPUT_REPORT_INDEX)
                {
                        // This code assumes that the output report is one byte long. Hence the following
                        // static assert is made.
                        STATIC_ASSERT(OUTPUT_REPORT_MAX_LEN == 1);

                        err_code = ble_hids_outp_rep_get(&m_hids,
                                                         report_index,
                                                         OUTPUT_REPORT_MAX_LEN,
                                                         0,
                                                         m_conn_handle,
                                                         &report_val);
                        APP_ERROR_CHECK(err_code);

                        if (!m_caps_on && ((report_val & OUTPUT_REPORT_BIT_MASK_CAPS_LOCK) != 0))
                        {
                                // Caps Lock is turned On.
                                NRF_LOG_INFO("Caps Lock is turned On!");
                                err_code = bsp_indication_set(BSP_INDICATE_ALERT_3);
                                APP_ERROR_CHECK(err_code);

                                keys_send(sizeof(m_caps_on_key_scan_str), m_caps_on_key_scan_str);
                                m_caps_on = true;
                        }
                        else if (m_caps_on && ((report_val & OUTPUT_REPORT_BIT_MASK_CAPS_LOCK) == 0))
                        {
                                // Caps Lock is turned Off .
                                NRF_LOG_INFO("Caps Lock is turned Off!");
                                err_code = bsp_indication_set(BSP_INDICATE_ALERT_OFF);
                                APP_ERROR_CHECK(err_code);

                                keys_send(sizeof(m_caps_off_key_scan_str), m_caps_off_key_scan_str);
                                m_caps_on = false;
                        }
                        else
                        {
                                // The report received is not supported by this application. Do nothing.
                        }
                }
        }
}


/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void)
{
        ret_code_t err_code;

