huybk213/nrf52-how-to-reject-bonding-from-central/ble_app_hids_keyboard_Yes_or_No/main.c
        err_code = bsp_indication_set(BSP_INDICATE_IDLE);
        APP_ERROR_CHECK(err_code);

        // Prepare wakeup buttons.
        err_code = bsp_btn_ble_sleep_mode_prepare();
        APP_ERROR_CHECK(err_code);

        // Go to system-off mode (this function will not return; wakeup will cause a reset).
        err_code = sd_power_system_off();
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling HID events.
 *
 * @details This function will be called for all HID events which are passed to the application.
 *
 * @param[in]   p_hids  HID service structure.
 * @param[in]   p_evt   Event received from the HID service.
 */
static void on_hids_evt(ble_hids_t * p_hids, ble_hids_evt_t * p_evt)
{
        switch (p_evt->evt_type)
        {
        case BLE_HIDS_EVT_BOOT_MODE_ENTERED:
                m_in_boot_mode = true;
                break;

        case BLE_HIDS_EVT_REPORT_MODE_ENTERED:
                m_in_boot_mode = false;
                break;

        case BLE_HIDS_EVT_REP_CHAR_WRITE:
                on_hid_rep_char_write(p_evt);
                break;

        case BLE_HIDS_EVT_NOTIF_ENABLED:
                break;

        default:
                // No implementation needed.
                break;
        }
}


/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
        ret_code_t err_code;

        switch (ble_adv_evt)
        {
        case BLE_ADV_EVT_DIRECTED_HIGH_DUTY:
                NRF_LOG_INFO("High Duty Directed advertising.");
                err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING_DIRECTED);
                APP_ERROR_CHECK(err_code);
                break;

        case BLE_ADV_EVT_DIRECTED:
                NRF_LOG_INFO("Directed advertising.");
                err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING_DIRECTED);
                APP_ERROR_CHECK(err_code);
                break;

        case BLE_ADV_EVT_FAST:
                NRF_LOG_INFO("Fast advertising.");
                err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
                APP_ERROR_CHECK(err_code);
                break;

        case BLE_ADV_EVT_SLOW:
                NRF_LOG_INFO("Slow advertising.");
                err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING_SLOW);
                APP_ERROR_CHECK(err_code);
                break;

        case BLE_ADV_EVT_FAST_WHITELIST:
                NRF_LOG_INFO("Fast advertising with whitelist.");
                err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING_WHITELIST);
                APP_ERROR_CHECK(err_code);
                break;

        case BLE_ADV_EVT_SLOW_WHITELIST:
                NRF_LOG_INFO("Slow advertising with whitelist.");
                err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING_WHITELIST);
                APP_ERROR_CHECK(err_code);
                break;

        case BLE_ADV_EVT_IDLE:
                sleep_mode_enter();
                break;

        case BLE_ADV_EVT_WHITELIST_REQUEST:
        {
                ble_gap_addr_t whitelist_addrs[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];
                ble_gap_irk_t whitelist_irks[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];
                uint32_t addr_cnt = BLE_GAP_WHITELIST_ADDR_MAX_COUNT;
                uint32_t irk_cnt  = BLE_GAP_WHITELIST_ADDR_MAX_COUNT;

                err_code = pm_whitelist_get(whitelist_addrs, &addr_cnt,
                                            whitelist_irks,  &irk_cnt);
                APP_ERROR_CHECK(err_code);
                NRF_LOG_DEBUG("pm_whitelist_get returns %d addr in whitelist and %d irk whitelist",
                              addr_cnt, irk_cnt);

                // Set the correct identities list (no excluding peers with no Central Address Resolution).
                identities_set(PM_PEER_ID_LIST_SKIP_NO_IRK);

                // Apply the whitelist.
                err_code = ble_advertising_whitelist_reply(&m_advertising,
                                                           whitelist_addrs,
                                                           addr_cnt,
                                                           whitelist_irks,
                                                           irk_cnt);
                APP_ERROR_CHECK(err_code);
        } break; //BLE_ADV_EVT_WHITELIST_REQUEST

        case BLE_ADV_EVT_PEER_ADDR_REQUEST:
        {
                pm_peer_data_bonding_t peer_bonding_data;

                // Only Give peer address if we have a handle to the bonded peer.
                if (m_peer_id != PM_PEER_ID_INVALID)
                {
                        err_code = pm_peer_data_bonding_load(m_peer_id, &peer_bonding_data);
                        if (err_code != NRF_ERROR_NOT_FOUND)
                        {
                                APP_ERROR_CHECK(err_code);

                                // Manipulate identities to exclude peers with no Central Address Resolution.
                                identities_set(PM_PEER_ID_LIST_SKIP_ALL);

                                ble_gap_addr_t * p_peer_addr = &(peer_bonding_data.peer_ble_id.id_addr_info);
                                err_code = ble_advertising_peer_addr_reply(&m_advertising, p_peer_addr);
                                APP_ERROR_CHECK(err_code);
                        }
                }
        } break; //BLE_ADV_EVT_PEER_ADDR_REQUEST

        default:
                break;
        }
}


/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
        ret_code_t err_code;

        switch (p_ble_evt->header.evt_id)
        {
        case BLE_GAP_EVT_CONNECTED:
                NRF_LOG_INFO("Connected");
                err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
                APP_ERROR_CHECK(err_code);
                m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
                err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
                APP_ERROR_CHECK(err_code);
                break;

        case BLE_GAP_EVT_DISCONNECTED:
                NRF_LOG_INFO("Disconnected");
                // Dequeue all keys without transmission.
                (void) buffer_dequeue(false);

                m_conn_handle = BLE_CONN_HANDLE_INVALID;

                // Reset m_caps_on variable. Upon reconnect, the HID host will re-send the Output
                // report containing the Caps lock state.
                m_caps_on = false;
                // disabling alert 3. signal - used for capslock ON
                err_code = bsp_indication_set(BSP_INDICATE_ALERT_OFF);
                APP_ERROR_CHECK(err_code);

