huybk213/nrf52-how-to-reject-bonding-from-central/ble_app_hids_keyboard_Yes_or_No/main.c
                break; // BLE_GAP_EVT_DISCONNECTED

        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
        {
                NRF_LOG_DEBUG("Security Request from Host");
                NRF_LOG_DEBUG("Press Button 2 -- Accept Bonding! or Button 3 -- Reject");
        }
        break;

        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
                NRF_LOG_DEBUG("PHY update request.");
                ble_gap_phys_t const phys =
                {
                        .rx_phys = BLE_GAP_PHY_AUTO,
                        .tx_phys = BLE_GAP_PHY_AUTO,
                };
                err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
                APP_ERROR_CHECK(err_code);
        } break;

        case BLE_GATTS_EVT_HVN_TX_COMPLETE:
                // Send next key event
                (void) buffer_dequeue(true);
                break;

        case BLE_GATTC_EVT_TIMEOUT:
                // Disconnect on GATT Client timeout event.
                NRF_LOG_DEBUG("GATT Client Timeout.");
                err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                                 BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                APP_ERROR_CHECK(err_code);
                break;

        case BLE_GATTS_EVT_TIMEOUT:
                // Disconnect on GATT Server timeout event.
                NRF_LOG_DEBUG("GATT Server Timeout.");
                err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                                 BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                APP_ERROR_CHECK(err_code);
                break;

        default:
                // No implementation needed.
                break;
        }
}


/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
        ret_code_t err_code;

        err_code = nrf_sdh_enable_request();
        APP_ERROR_CHECK(err_code);

        // Configure the BLE stack using the default settings.
        // Fetch the start address of the application RAM.
        uint32_t ram_start = 0;
        err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
        APP_ERROR_CHECK(err_code);

        // Enable BLE stack.
        err_code = nrf_sdh_ble_enable(&ram_start);
        APP_ERROR_CHECK(err_code);

        // Register a handler for BLE events.
        NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}


/**@brief Function for the Event Scheduler initialization.
 */
static void scheduler_init(void)
{
        APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}


/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
static void bsp_event_handler(bsp_event_t event)
{
        uint32_t err_code;
        static uint8_t * p_key = m_sample_key_press_scan_str;
        static uint8_t size  = 0;

        switch (event)
        {
        case BSP_EVENT_SLEEP:
                sleep_mode_enter();
                break;

        case BSP_EVENT_DISCONNECT:
                err_code = sd_ble_gap_disconnect(m_conn_handle,
                                                 BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                        APP_ERROR_CHECK(err_code);
                }
                break;

        case BSP_EVENT_WHITELIST_OFF:
                if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
                {
                        err_code = ble_advertising_restart_without_whitelist(&m_advertising);
                        if (err_code != NRF_ERROR_INVALID_STATE)
                        {
                                APP_ERROR_CHECK(err_code);
                        }
                }
                break;

        case BSP_EVENT_KEY_0:
                if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
                {
                        keys_send(1, p_key);
                        p_key++;
                        size++;
                        if (size == MAX_KEYS_IN_ONE_REPORT)
                        {
                                p_key = m_sample_key_press_scan_str;
                                size  = 0;
                        }
                }
                break;
#if PM_SECURITY_USER_SELECTION_ENABLED
        case BSP_EVENT_KEY_2:
        {
                NRF_LOG_DEBUG("Press Key 2 to accept bonding!");

                if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
                {
                        pm_conn_sec_params_pending_reply(m_conn_handle, &m_sec_param);
                        bonding_reply_timer_stop();
                }
        }
        break;

        case BSP_EVENT_KEY_3:
        {
                NRF_LOG_DEBUG("Press Key 3 to reject bonding!");
                if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
                {
                        err_code = sd_ble_gap_sec_params_reply(m_conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, &m_sec_params_reply_context);
                        APP_ERROR_CHECK(err_code);
                        bonding_reply_timer_stop();
                }
        }
        break;
#endif

        default:
                break;
        }
}

/**@brief Function for the Peer Manager initialization.
 */
static void peer_manager_init(void)
{
        ble_gap_sec_params_t sec_param;
        ret_code_t err_code;

        err_code = pm_init();
        APP_ERROR_CHECK(err_code);

#if PM_SECURITY_USER_SELECTION_ENABLED
        err_code = local_pm_secure_mode_set();
        APP_ERROR_CHECK(err_code);

#else
        memset(&sec_param, 0, sizeof(ble_gap_sec_params_t));
        // // Security parameters to be used for all security procedures.
        sec_param.bond           = SEC_PARAM_BOND;
        sec_param.mitm           = SEC_PARAM_MITM;
        sec_param.lesc           = SEC_PARAM_LESC;
        sec_param.keypress       = SEC_PARAM_KEYPRESS;
        sec_param.io_caps        = SEC_PARAM_IO_CAPABILITIES;
        sec_param.oob            = SEC_PARAM_OOB;
        sec_param.min_key_size   = SEC_PARAM_MIN_KEY_SIZE;
        sec_param.max_key_size   = SEC_PARAM_MAX_KEY_SIZE;
        sec_param.kdist_own.enc  = 1;
        sec_param.kdist_own.id   = 1;
        sec_param.kdist_peer.enc = 1;
        sec_param.kdist_peer.id  = 1;

        err_code = pm_sec_params_set(&sec_param);
        APP_ERROR_CHECK(err_code);
#endif


        err_code = pm_register(pm_evt_handler);
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
        uint32_t err_code;
        uint8_t adv_flags;
        ble_advertising_init_t init;

